if(exist("n")==0 || n<0) n = n0  # ループ変数の初期化

#-------------------------------------------------------------------------------
# プロット
#-------------------------------------------------------------------------------
filename = sprintf("outputPressure/output%03d.dat", n) # n番目のデータファイルの名前の生成
set palette define (0 "white", 1 "blue")
splot filename using 1:2:3:4 w p lc palette
#-------------------------------------------------------------------------------
# ループ処理
#-------------------------------------------------------------------------------
n = n + dn            # ループ変数の増加
if ( n < n1 ) reread  # ループの評価
undefine n            # ループ変数の削除